In [46]:
import numpy as np
import pandas as pd

In [47]:
L = [1,2,3,4,5]
P = pd.Series(L, index = ['a', 'b', 'c', 'd', 'e'])
P

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [48]:
P['e']

5

In [49]:
P[['a', 'c']]

a    1
c    3
dtype: int64

In [50]:
P.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [51]:
P.values

array([1, 2, 3, 4, 5], dtype=int64)

In [52]:
charcter = {'name':['나루토', '가아라', '킬러비', '하쿠', '데이다라'],
            'town':['나뭇잎', '모래', '구름', '안개', '바위'],
            'age':[15,15,38,13,19],
            'skill':['나선환','사박궤','미수옥','빙결','폭탄']
}

In [53]:
ninja = pd.DataFrame(charcter)
ninja

   name town  age skill
0   나루토  나뭇잎   15   나선환
1   가아라   모래   15   사박궤
2   킬러비   구름   38   미수옥
3    하쿠   안개   13    빙결
4  데이다라   바위   19    폭탄

In [54]:
ninja.index = ['A', 'B', 'C', 'D', 'E']
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [55]:
ninja.loc['C']

name     킬러비
town      구름
age       38
skill    미수옥
Name: C, dtype: object

In [56]:
ninja.iloc[4]

name     데이다라
town       바위
age        19
skill      폭탄
Name: E, dtype: object

In [57]:
ninja.loc[['B', 'D', 'E']]

   name town  age skill
B   가아라   모래   15   사박궤
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [58]:
ninja.iloc[2:4]

  name town  age skill
C  킬러비   구름   38   미수옥
D   하쿠   안개   13    빙결

In [59]:
ninja.loc[['A', 'D'], 'name':'age']

  name town  age
A  나루토  나뭇잎   15
D   하쿠   안개   13

In [60]:
ninja.iloc[[2,4], 1:3]

  town  age
C   구름   38
E   바위   19

In [61]:
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙결
E  데이다라   바위   19    폭탄

In [62]:
ninja.loc['D', 'skill'] = '빙둔'
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙둔
E  데이다라   바위   19    폭탄

In [63]:
ninja.loc[ninja['age'] >16]

   name town  age skill
C   킬러비   구름   38   미수옥
E  데이다라   바위   19    폭탄

In [64]:
ninja['age'].mean()

20.0

In [65]:
ninja.loc[(ninja['age'] > 16) & (ninja['age'] < 20)]

   name town  age skill
E  데이다라   바위   19    폭탄

In [66]:
ninja.iloc[[0, 3]]

  name town  age skill
A  나루토  나뭇잎   15   나선환
D   하쿠   안개   13    빙둔

In [67]:
ninja[['town', 'age']]

  town  age
A  나뭇잎   15
B   모래   15
C   구름   38
D   안개   13
E   바위   19

In [68]:
ninja[['name', 'skill']]

   name skill
A   나루토   나선환
B   가아라   사박궤
C   킬러비   미수옥
D    하쿠    빙둔
E  데이다라    폭탄

In [69]:
sum(ninja['age'])

100

In [70]:
ninja['age'].mean()

20.0

In [71]:
max(ninja['age'])

38

In [40]:
ninja.rename(columns= {'skill' : 'tech'}, inplace = True)
ninja

   name town  age tech
A   나루토  나뭇잎   15  나선환
B   가아라   모래   15  사박궤
C   킬러비   구름   38  미수옥
D    하쿠   안개   13   빙둔
E  데이다라   바위   19   폭탄

In [72]:
ninja.drop('D')

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
E  데이다라   바위   19    폭탄

In [74]:
ninja.drop(['name', 'town'], axis = 1)

   age skill
A   15   나선환
B   15   사박궤
C   38   미수옥
D   13    빙둔
E   19    폭탄

In [75]:
ninja

   name town  age skill
A   나루토  나뭇잎   15   나선환
B   가아라   모래   15   사박궤
C   킬러비   구름   38   미수옥
D    하쿠   안개   13    빙둔
E  데이다라   바위   19    폭탄